# ExternalResourceType Operators

---
The ExternalResourceType type exposes the following members.
| Name| Description
---|---|---
| Equality(ExternalResourceType, ExternalResourceType)| Compares two ExternalResourceType instances.
| Inequality(ExternalResourceType, ExternalResourceType)| Compares two ExternalResourceType instances.
Top
#### Reference
ExternalResourceType Class
Autodesk.Revit.DB Namespace